# Pandas
- Introduction to Pandas

# Key Data Structure 
- Series
- DataFrame

In [1]:
import pandas as pd

# Series
- 1 Dimensional

In [4]:

s = pd.Series([1,2,3,4,5] , index=['a','b','c','d','e'])
s

a    1
b    2
c    3
d    4
e    5
dtype: int64

# DataFrame
- 2 Dimensional

In [5]:
df = pd.DataFrame({"names":['Ayaz','Ali','Khan'],"marks" : [100,53,68]})
df

  names  marks
0  Ayaz    100
1   Ali     53
2  Khan     68